layer {
  name: "data"
  type: "MultiImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false 
    scale: 0.00390625
    # crop_size: 224
    mean_value: 104
    mean_value: 117
    mean_value: 123
  }
  multiimage_data_param {
    # root_folder: "/mnt/data1/lidw/dataset/"
    root_folder: "./../../data/RAP_dataset/"
    source: "./../static/classification/rap2_ide_val.txt"
    shuffle: false 
    batch_size: 128 
    new_height: 160
    new_width: 64
  }
}
layer {
  name: "conv0_scale1"
  type: "Convolution"
  bottom: "data"
  top: "conv0_scale1"
  param {
    name: "conv0_scale1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv0_scale1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "bn0_scale1"
  type: "BatchNorm"
  bottom: "conv0_scale1"
  top: "bn0_scale1"
  param {
    name: "bn0_scale1_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn0_scale1_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn0_scale1_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "relu0"
  type: "ReLU"
  bottom: "bn0_scale1"
  top: "bn0_scale1"
}
layer {
  name: "pool0"
  type: "Pooling"
  bottom: "bn0_scale1"
  top: "pool0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv1_scale1"
  type: "Convolution"
  bottom: "pool0"
  top: "conv1_scale1"
  param {
    name: "conv1_scale1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_scale1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "conv1_scale2"
  type: "Convolution"
  bottom: "pool0"
  top: "conv1_scale2"
  param {
    name: "conv1_scale2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_scale2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 2
  }
}
layer {
  name: "conv1_scale3"
  type: "Convolution"
  bottom: "pool0"
  top: "conv1_scale3"
  param {
    name: "conv1_scale3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_scale3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 3
  }
}
layer {
  name: "bn1_scale1"
  type: "BatchNorm"
  bottom: "conv1_scale1"
  top: "bn1_scale1"
  param {
    name: "bn1_scale1_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn1_scale1_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn1_scale1_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn1_scale2"
  type: "BatchNorm"
  bottom: "conv1_scale2"
  top: "bn1_scale2"
  param {
    name: "bn1_scale2_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn1_scale2_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn1_scale2_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn1_scale3"
  type: "BatchNorm"
  bottom: "conv1_scale3"
  top: "bn1_scale3"
  param {
    name: "bn1_scale3_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn1_scale3_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn1_scale3_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn1"
  type: "Concat"
  bottom: "bn1_scale1"
  bottom: "bn1_scale2"
  bottom: "bn1_scale3"
  top: "bn1"
  concat_param {
    axis: 1
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "bn1"
  top: "bn1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "bn1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_scale1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_scale1"
  param {
    name: "conv2_scale1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_scale1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "conv2_scale2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_scale2"
  param {
    name: "conv2_scale2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_scale2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 2
  }
}
layer {
  name: "conv2_scale3"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_scale3"
  param {
    name: "conv2_scale3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_scale3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 3
  }
}
layer {
  name: "bn2_scale1"
  type: "BatchNorm"
  bottom: "conv2_scale1"
  top: "bn2_scale1"
  param {
    name: "bn2_scale1_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn2_scale1_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn2_scale1_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn2_scale2"
  type: "BatchNorm"
  bottom: "conv2_scale2"
  top: "bn2_scale2"
  param {
    name: "bn2_scale2_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn2_scale2_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn2_scale2_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn2_scale3"
  type: "BatchNorm"
  bottom: "conv2_scale3"
  top: "bn2_scale3"
  param {
    name: "bn2_scale3_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn2_scale3_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn2_scale3_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn2"
  type: "Concat"
  bottom: "bn2_scale1"
  bottom: "bn2_scale2"
  bottom: "bn2_scale3"
  top: "bn2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "bn2"
  top: "bn2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "bn2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_scale1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_scale1"
  param {
    name: "conv3_scale1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_scale1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "conv3_scale2"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_scale2"
  param {
    name: "conv3_scale2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_scale2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 2
  }
}
layer {
  name: "conv3_scale3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_scale3"
  param {
    name: "conv3_scale3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_scale3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 3
  }
}
layer {
  name: "bn3_scale1"
  type: "BatchNorm"
  bottom: "conv3_scale1"
  top: "bn3_scale1"
  param {
    name: "bn3_scale1_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn3_scale1_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn3_scale1_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn3_scale2"
  type: "BatchNorm"
  bottom: "conv3_scale2"
  top: "bn3_scale2"
  param {
    name: "bn3_scale2_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn3_scale2_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn3_scale2_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn3_scale3"
  type: "BatchNorm"
  bottom: "conv3_scale3"
  top: "bn3_scale3"
  param {
    name: "bn3_scale3_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn3_scale3_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn3_scale3_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn3"
  type: "Concat"
  bottom: "bn3_scale1"
  bottom: "bn3_scale2"
  bottom: "bn3_scale3"
  top: "bn3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "bn3"
  top: "bn3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "bn3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_scale1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_scale1"
  param {
    name: "conv4_scale1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_scale1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 1
  }
}
layer {
  name: "conv4_scale2"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_scale2"
  param {
    name: "conv4_scale2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_scale2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 2
  }
}
layer {
  name: "conv4_scale3"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_scale3"
  param {
    name: "conv4_scale3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_scale3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 3
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
    dilation: 3
  }
}
layer {
  name: "bn4_scale1"
  type: "BatchNorm"
  bottom: "conv4_scale1"
  top: "bn4_scale1"
  param {
    name: "bn4_scale1_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn4_scale1_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn4_scale1_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn4_scale2"
  type: "BatchNorm"
  bottom: "conv4_scale2"
  top: "bn4_scale2"
  param {
    name: "bn4_scale2_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn4_scale2_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn4_scale2_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn4_scale3"
  type: "BatchNorm"
  bottom: "conv4_scale3"
  top: "bn4_scale3"
  param {
    name: "bn4_scale3_mean"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn4_scale3_var"
    lr_mult: 0
    decay_mult: 0
  }
  param {
    name: "bn4_scale3_bias"
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "bn4"
  type: "Concat"
  bottom: "bn4_scale1"
  bottom: "bn4_scale2"
  bottom: "bn4_scale3"
  top: "bn4"
  concat_param {
    axis: 1
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "bn4"
  top: "bn4"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "bn4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "pool4"
  top: "fc1"
  param {
    name: "fc1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc1_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fc1_dropout"
  type: "Dropout"
  bottom: "fc1"
  top: "fc1"
  dropout_param{
    dropout_ratio: 0.7
  }
}
layer {
  name: "fc2"
  type: "InnerProduct"
  bottom: "fc1"
  top: "fc2"
  param {
    name: "fc2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc2_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1295 
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_cls"
  type: "SoftmaxWithLoss"
  bottom: "fc2"
  bottom: "label"
  top: "loss_cls"
}
layer {
  name: "acc_cls"
  type: "Accuracy"
  bottom: "fc2"
  bottom: "label"
  top: "acc_cls"
}
